"use strict"




// var Tf = (9 / 5);
// var Tc = 32;

// alert('сколько будет 32 градуса сейльсия в фаренгейтах, чтобы узнать ответ нажмите ОК')
// alert(Tf * Tc)

// var name = 'Василий';

// var admin = 'Василий';

// alert(admin)


// alert(1000 + "108") //будет = 1000108

// ############################################## ВТОРОЙ УРОК ###################################### //
// ############################################## ВТОРОЙ УРОК ###################################### //

//##### правила функции start          ##############################################


// function f(a, b) {
//     var res = a + b;

//     return res;
// }

// вызов функции  
// console.log(f(2, 3));


// вызов функции c промежуточной переменой

// var x = f(5, 10);
// console.log(x);

//####### правила функции the end #######################################



//############### непонятная штука start #######################################

// function f() {
//     console.log('x');
//     y();
// }

// function y() {
//     console.log('y');
//     z();
// }

// function z() {
//     console.log('z');

// }

// x();

// ########################## непонятная штука end  ############################################


//################# ПРИВЕДЕНИЕ СТРОКИ К ЧИСЛУ START ###########################################


// let x = '5';

// x++ // оператор присовоение ++ = 5+1, к числу добовляется 1

// console.log(x);

// console.log(Number(x)); // namber приводит строку к числу но несможен привести '5px'

// console.log(parseInt(x)); // parseInt  приводит строку к числу даже если в строке есть буквы '5px'


//###################### ПРИВЕДЕНИЕ СТРОКИ К ЧИСЛУ THE END ########################################


//################# УНАРНЫЙ ОПЕРАТОР ПРИСВАИВАНИЯ ++ START ###########################################

// let x = 5;

// x++ // оператор присовоение ++ = 5+1, к числу добовляется 1

// console.log(x); //= 6

// let y = 1 + ++x

// console.log(y); // = 8 

//###################### ОПЕРАТОР ПРИСВАИВАНИЯ ++ ЧИСЛУ END ########################################


//################# ОПЕРАТОРЫ СРАВНЕНИЕ START  ###########################################

// 5 == '5' // оператор не строго стравнения вернет true

// 5 === '5' // оператор строго стравнения вернет false

// alert( 2 > 1 );  // true (верно)
// alert( 2 == 1 ); // false (неверно)
// alert( 2 != 1 ); // true (верно)

//################# ОПЕРАТОРЫ СРАВНЕНИЕ THE END  ###########################################


//################# ЛОГИЧЕСКИЕ ОПЕРАТОРЫ || (ИЛИ) && (И)  START  ###########################################

// || (ИЛИ) // оператор или

// alert( true || true ); // true
// alert( false || true ); // true
// alert( true || false ); // true
// alert( false || false ); // false

// && (И)

// alert( true && true ); // true
// alert( false && true ); // false
// alert( true && false ); // false
// alert( false && false ); // false

//################# ЛОГИЧЕСКИЕ ОПЕРАТОРЫ  THE END  ###########################################


//################# ОПЕРАТОРЫ ВЕТВЛЕНИЯ  START  ###########################################

// let x = 5

// if (x < 1) { // условия
//     alert('x меньше одного'); // действие
// } else if (x > 1) { // условия
//     alert('x больше одного'); // действие
// } else { // условия
//     alert('нет верного решения'); // действие
// }

// //

// let x = 1

// switch (x) { // если case равно 5 выполняется  console.log('one')
//     case 1: // условия
//         console.log('one') // действие

//         break;
//     case 2: // условия
//         console.log('two') // действие

//         break;
//     case 3: // условия
//         console.log('three') // действие

//         break;

//     default: // еслли не одно условие не сработает, тогда отработает  default
//         console.log('fuk')
//         break;
// }





//################# ОПЕРАТОРЫ ВЕТВЛЕНИЯ  THE END  ###########################################


//################# РЕКУРСИВНЫЙ ВЫЗОВ ФУНКЦИИ  START  ###########################################

// let year = prompt('В каком году была опубликована спецификация ECMAScript-2015?', '');

// if (year < 2015) {
//     alert('Это слишком рано...');
// } else if (year > 2015) {
//     alert('Это поздновато');
// } else {
//     alert('Верно!');
// }

// let namber = prompt('В каком году была опубликована спецификация ECMAScript-2015?', '');

// if (namber > 1) {
//     alert('значение больше одного');
// } else if (namber < -1) {
//     alert('число меньше -1');
// } else  (namber == 0) {
//     alert('значение равно 0');
// }



//################# РЕКУРСИВНЫЙ ВЫЗОВ ФУНКЦИИ  THE END  ###########################################


// let user = 'Вася',
//     age = 36;


let user

let userName = 'Вася'


user = userName

console.log(user);